Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Quarkus is part of the Commonhaus Foundation
ja_jp: QuarkusはCommonhaus Foundationの一部です

source: Quarkus is part of the Commonhaus Foundation.
ja_jp: QuarkusはCommonhaus Foundationの一部です。

source: Quarkus is powered by a xref:quarkus-reactive-architecture.adoc#engine[reactive engine], and when developing a reactive application, your code is executed on one of the few I/O threads. Remember, you must never block these threads, and the model would collapse if you do. So, you can't use blocking I/O. Instead, you need to schedule the I/O operation and pass a continuation.
ja_jp: Quarkusは link:quarkus-reactive-architecture.html#engine[リアクティブエンジン]を搭載しており、リアクティブアプリケーションを開発する際には、数少ないI/Oスレッドの1つでコードが実行されます。覚えておいてほしいのは、これらのスレッドを絶対にブロックしてはいけないということで、ブロックしてしまうとモデルが崩壊してしまいます。つまり、ブロッキングI/Oは使えないのです。代わりに、I/O操作をスケジュールして、継続を渡す必要があります。

source: Quarkus is pragmatic and versatile. You decide how to develop and execute your application. You can use the imperative way, the reactive way, or mix them, using reactive on the parts of the application under high concurrency.
ja_jp: Quarkusは実用的で多機能です。アプリケーションをどのように開発し、実行するかはユーザーが決定します。命令型の方法やリアクティブ型の方法を使用することもできますし、それらを混在させて、並行性の高いアプリケーションの部分にリアクティブ型の方法を使用することもできます。

source: Quarkus is reactive. It's even more than this: Quarkus unifies reactive and imperative programming. You don't even have to choose: you can implement reactive components and imperative components then combine them inside the very **same** application. No need to use different stacks, tooling or APIs; Quarkus bridges both worlds.
ja_jp: Quarkusはリアクティブです。それだけではありません。Quarkusは、リアクティブ型プログラミングと命令型プログラミングを統合しています。リアクティブ型なコンポーネントと命令型のコンポーネントを実装し、 *同じ* アプリケーション内で組み合わせることができます。異なるスタック、ツール、APIを使用する必要はありません。Quarkusは両方の世界の架け橋です。

source: Quarkus is stable?
ja_jp: Quarkusは安定していますか?

source: Quarkus is supersonic subatomic Java with a focus on cloud-native applications. The idea behind Quarkus has always been to do at build-time what traditional frameworks do at runtime. Quarkus is optimized for low memory usage and fast startup times. Quarkus brings back _developer joy_ to Java and enables every Java developer out there to use their skills to develop cloud-native apps, including AWS Lambda workloads.
ja_jp: Quarkusは、クラウドネイティブアプリケーションに特化したsupersonic subatomic Java です。Quarkusの背後にあるアイデアは、従来のフレームワークが実行時に行うことをビルド時に行うことです。Quarkusは、低メモリ使用量と高速起動を実現するように最適化されています。Quarkusは、Javaに _開発者の喜び_ を取り戻し、すべてのJava開発者が、AWS Lambdaワークロードを含むクラウドネイティブアプリケーションを開発するためにそのスキルを使用できるようにします。

source: Quarkus is the rising star for Kube Native Java as it re-imagines the Java stack to give you the performance characteristics and developer experience you need to create modern, high performing applications. Quarkus helps you use your existing skills and code in new ways and greatly reduces the technical burden when moving to a Kubernetes-centric environment.
ja_jp: Quarkus は、Java スタックを再構築し、最新の高性能アプリケーションを作成するために必要なパフォーマンス特性と開発者エクスペリエンスを提供することで、Kube Native Java の新星として台頭しています。Quarkus は、既存のスキルとコードを新しい方法で使用するのに役立ち、Kubernetes 中心環境への移行時の技術的負担を大幅に軽減します。

source: Quarkus is using GraalVM to build a native executable. One of the limitations of GraalVM is the usage of https://github.com/oracle/graal/blob/master/docs/reference-manual/native-image/Limitations.md#reflection[Reflection, window="_blank"]. Reflective operations are supported but all relevant members must be registered for reflection explicitly. Those registrations result in a bigger native executable.
ja_jp: Quarkus では、GraalVM を使用してネイティブ実行可能ファイルをビルドしています。GraalVM の制限事項の 1 つは、 https://github.com/oracle/graal/blob/master/docs/reference-manual/native-image/Limitations.md#reflection[リフレクション, window="_blank"] の使用です。リフレクション操作はサポートされていますが、関連するすべてのメンバーを明示的にリフレクション用に登録する必要があります。これらの登録を行うと、より大きなネイティブ実行可能ファイルになります。

source: Quarkus is using GraalVM to build a native executable. One of the limitations of GraalVM is the usage of https://www.graalvm.org/{graalvm-version}/reference-manual/native-image/Reflection/[Reflection, window="_blank"]. Reflective operations are supported but all relevant members must be registered for reflection explicitly. Those registrations result in a bigger native executable.
ja_jp: Quarkus は GraalVM を使用してネイティブ実行可能ファイルをビルドしています。GraalVM での制限の 1 つは、 https://www.graalvm.org/{graalvm-version}/reference-manual/native-image/Reflection/[リフレクション, window="_blank"] の使用です。リフレクティブ操作はサポートされていますが、関連するすべてのメンバーをリフレクション用に明示的に登録する必要があります。これらの登録により、ネイティブ実行可能ファイルが大きくなります。

source: Quarkus is using GraalVM to build a native executable. One of the limitations of GraalVM is the usage of link:https://www.graalvm.org/{graalvm-docs-version}/reference-manual/native-image/Reflection/[Reflection, window="_blank"]. Reflective operations are supported but all relevant members must be registered for reflection explicitly. Those registrations result in a bigger native executable.
ja_jp: Quarkus は GraalVM を使用してネイティブ実行可能ファイルを構築します。 GraalVM の制限の 1 つは、link:https://www.graalvm.org/{graalvm-docs-version}/reference-manual/native-image/Reflection/[リフレクション, window="_blank"] の使用量です。 リフレクション操作はサポートされていますが、関連するすべてのメンバーを明示的にリフレクションに登録する必要があります。 これらの登録により、ネイティブ実行可能ファイルが大きくなります。

source: Quarkus is using GraalVM to build a native executable. One of the limitations of GraalVM is the usage of link:https://www.graalvm.org/{graalvm-docs-version}/reference-manual/native-image/Reflection/[Reflection, window="_blank"]. Reflective operations are supported, but all relevant members must be registered for reflection explicitly. Those registrations result in a bigger native executable.
ja_jp: Quarkus は GraalVM を使用してネイティブ実行可能ファイルをビルドします。GraalVM の制限の 1 つは、link:https://www.graalvm.org/{graalvm-docs-version}/reference-manual/native-image/Reflection/[リフレクション, window="_blank"] の使用です。リフレクティブな操作はサポートされていますが、関連するすべてのメンバーを明示的にリフレクションに登録する必要があります。これらの登録により、ネイティブ実行可能ファイルが大きくなります。

source: Quarkus is using https://github.com/smallrye/smallrye-config[SmallRye Config] for wiring application configuration. A Quarkus platform may be used as another source of configuration in the hierarchy of the configuration sources dominated by the application's `application.properties`.
ja_jp: Quarkusは、アプリケーション設定の接続に link:https://github.com/eclipse/microprofile-config[SmallRye Config]を使用しています。Quarkusプラットフォームは、アプリケーションの `application.properties` によって支配されている構成ソースの階層の別の構成ソースとして使用することができます。

source: Quarkus is well known for its backend extensions ecosystem and developer experience, if you combine it with great extensions for frontend, then it is a perfect mix! All the testing and dev-mode features are now available for both frontend and backend.
ja_jp: Quarkus は、バックエンドのエクステンションのエコシステムと開発者エクスペリエンスなどが、よく知られていますが、これをフロントエンドの優れたエクステンションと組み合わせると、完璧な組み合わせになります。すべてのテスト機能と開発モード機能が、フロントエンドとバックエンドの両方で利用できるようになりました。

source: Quarkus itself is configured via the same mechanism as your application. Quarkus reserves the `quarkus.` namespace for its own configuration. For example to configure the HTTP server port you can set `quarkus.http.port` in `application.properties`. All the Quarkus configuration properties are xref:all-config.adoc[documented and searchable].
ja_jp: Quarkus自体は、アプリケーションと同じメカニズムで設定されます。Quarkusは、自身の設定のために `quarkus.` 名前空間を予約します。例えば、HTTPサーバーポートを設定するには、 `quarkus.http.port` を `application.properties` に設定します。Quarkusのすべての設定プロパティは link:all-config.html[文書化されており、検索可能]です。

source: Quarkus lambdas can be deployed using the Amazon Java Runtime, or you can build a native executable and use Amazon's Custom Runtime if you want a smaller memory footprint and faster cold boot startup time.
ja_jp: Quarkusの Lambda は、Amazon Javaランタイムを使用してデプロイすることもできますが、より小さなメモリーフットプリントとより高速なコールドブート起動時間が必要な場合は、ネイティブ実行可能ファイルをビルドしてAmazonのカスタムランタイムを使用することもできます。

source: Quarkus leverages SmallRye Health, an implementation of the MicroProfile Health specification. This allows applications to provide information about their state to external viewers in a Kubernetes environment where automated processes must be able to determine whether the application should be discarded or restarted.
ja_jp: Quarkusは、MicroProfile Health仕様の実装であるSmallRye Healthを活用しています。これにより、アプリケーションはKubernetes環境でその状態に関する情報を外部のビューアーに提供できます。Kubernetes環境では、自動化されたプロセスがアプリケーションを破棄すべきか再起動すべきかを判断できる必要があります。

source: Quarkus log participation
ja_jp: Quarkus ログへの参加

source: Quarkus logging extensions
ja_jp: Quarkus ロギングエクステンション

source: Quarkus magic relies on bytecode generation at build time rather than waiting for the runtime code evaluation, that's the role of your extension's `deployment` module. Calm down, we know, bytecode is hard and you don't want to do it manually, Quarkus proposes a high level API to make your life easier. Thanks to basic concepts, you will describe the items to produce/consume and the corresponding steps in order to generate the bytecode to produce during the deployment time.
ja_jp: `deployment` Quarkus magic は、実行時のコード評価を待つのではなく、ビルド時のバイトコード生成に依存しています。これは、エクステンションの `deployment` モジュールのロールです。安心してください。バイトコードは難しいので、手動での作業は理想的でないことは理解しています。基本的な概念のおかげで、デプロイ時に生成するバイトコード生成のために、生成/消費するアイテムとそれに対応するステップを説明します。

source: Quarkus magic relies on bytecode generation at build time rather than waiting for the runtime code evaluation, that's the role of your extension's `deployment` module. Calm down, we know, bytecode is hard and you don't want to do it manually. Quarkus proposes a high level API to make your life easier. Thanks to basic concepts, you will describe the items to produce/consume and the corresponding steps in order to generate the bytecode to produce during the deployment time.
ja_jp: Quarkus マジックは、実行時のコード評価を待つのではなく、ビルド時のバイトコード生成に依存します。これは、エクステンションの `deployment` モジュールの役割です。落ち着いてください、バイトコードは難しいので、手動でやりたくないでしょう。 Quarkus は、作業を楽にする高レベルの API を提案しています。基本的な概念のおかげで、デプロイ時に生成するバイトコードを生成するために、生成/消費する項目と対応する手順を説明できます。

source: Quarkus magic relies on bytecode generation at build time rather than waiting for the runtime code evaluation, that's the role of your extension's `deployment` module. Calm down, we know, bytecode is hard, and you don't want to do it manually. Quarkus proposes a high level API to make your life easier. Thanks to basic concepts, you will describe the items to produce/consume and the corresponding steps in order to generate the bytecode to produce during the deployment time.
ja_jp: Quarkus マジックは、実行時のコード評価を待つのではなく、ビルド時のバイトコード生成に依存します。これがエクステンションの `deployment` モジュールの役割です。落ち着いてください、バイトコードは難しく、手動で行いたくないことは理解しています。Quarkus は、作業を楽にする高レベルの API を提案しています。基本的な概念のおかげで、デプロイ時に生成するバイトコードを生成するために、生成/消費する項目と対応する手順を記述できます。

source: Quarkus mailer supports JKS, PCKS#12 and PEM trust stores. For PEM, you can configure multiple files. For JKS and PCKS#12, you can configure the password if any.
ja_jp: Quarkus mailerは、JKS、PCKS#12、PEMのtrust storeをサポートしています。PEMでは、複数のファイルを設定することができます。JKSとPCKS#12では、パスワードが存在する場合、設定することができます。

source: Quarkus mailer supports JKS, PKCS#12 and PEM trust stores. For PEM, you can configure multiple files. For JKS and PKCS#12, you can configure the password if any.
ja_jp: Quarkus mailerは、JKS、PCKS#12、PEMのトラストストアをサポートしています。PEMでは、複数のファイルを設定することができます。JKSとPCKS#12では、パスワードが存在する場合、設定することができます。

source: Quarkus makes AppCDS generation as simple as setting the `quarkus.package.create-appcds` configuration property to `true`. For an example Quarkus application using Maven (assuming it is located in `/tmp/code-with-quarkus`), the AppCDS archive can be generated by simply building the application like so:
ja_jp: Quarkusでは、 `quarkus.package.create-appcds` 設定プロパティを `true` に設定するだけで、簡単にAppCDSを生成できます。Mavenを使用したQuarkusアプリケーションの例（ `/tmp/code-with-quarkus` にあると仮定）では、次のようにアプリケーションをビルドするだけで、AppCDSアーカイブが生成されます。

source: Quarkus makes AppCDS generation as simple as setting the `quarkus.package.jar.appcds.enabled` configuration property to `true`. For an example Quarkus application using Maven (assuming it is located in `/tmp/code-with-quarkus`), the AppCDS archive can be generated by simply building the application like so:
ja_jp: Quarkusでは、 `quarkus.package.jar.appcds.enabled` 設定プロパティを `true` に設定するだけで、AppCDSを簡単に生成できます。 例えば、Mavenを使用するQuarkusアプリケーション（ `/tmp/code-with-quarkus` にあると仮定）では、次のようにアプリケーションをビルドするだけで、AppCDSアーカイブを生成できます：

source: Quarkus makes Java supersonic and subatomic, with fast startup times, low memory footprint, and a small disk footprint. This release continues to improve the Quarkus framework's performance and efficiency.
ja_jp: Quarkusは、高速な起動時間、低いメモリフットプリント、小さなディスクフットプリントにより、Javaを超高速 かつ超軽量にします。このリリースでは、Quarkusフレームワークのパフォーマンスと効率性を引き続き向上させています。

source: Quarkus makes developing Java easier and more efficient than ever. No longer do I have to switch between multiple terminals to find the right one to rebuild my code, Quarkus makes it automatic.
ja_jp: Quarkusは、Javaの開発をこれまで以上に簡単かつ効率的にします。コードをリビルドするのに適した端末を探すために、複数のターミナルを切り替える必要はもうありません。Quarkusはそれを自動的に行ってくれます。

source: Quarkus makes it easy to change your code on the fly. Let's modify the <a href="http://localhost:8080/hello">RESTful endpoint</a>
ja_jp: Quarkus を使用すると、コードをその場で簡単に変更できます。<a href="http://localhost:8080/hello">RESTful エンドポイント</a>を変更してみましょう。

source: Quarkus makes it easy to deploy microservice applications to Kubernetes without having to understand the intricacies of the underlying Kubernetes framework. Extensions are available for Kubernetes, and Kubernetes distributions, to facilitate this process with only a minimal amount of configuration variables needed.
ja_jp: Quarkusでは、基盤となるKubernetesフレームワークの複雑な仕組みを理解することなく、マイクロサービスアプリケーションをKubernetesに簡単にデプロイできます。KubernetesやKubernetesのディストリビューションに対応したエクステンションが用意されており、必要最小限の設定変数のみでこのプロセスを促進することができます。

source: Quarkus makes registration of reflection in an extension a breeze by using `ReflectiveClassBuildItem`, thus eliminating the need for a JSON configuration file.
ja_jp: Quarkus では、`ReflectiveClassBuildItem` を使用することで、エクステンションへのリフレクションの登録が簡単になり、JSON 設定ファイルが不要になります。

source: Quarkus metrics graphic
ja_jp: Quarkus のメトリクスグラフィック

source: Quarkus needs JDK 11, so we specify that first:
ja_jp: QuarkusはJDK 11を必要とするので、まずそれを指定します。

source: Quarkus needs JDK 17, so we specify that first:
ja_jp: QuarkusにはJDK 17が必要なので、まずそれを指定します：

source: Quarkus needs to restart if one of the following is true:
ja_jp: 次のいずれかに該当する場合は、Quarkus を再起動する必要があります。

source: Quarkus now has extensions for DynamoDB, S3, SNS and SQS (more coming). Please check link:{amazon-services-guide}[those guides] on how to use the various AWS Services with Quarkus, as opposed to wiring manually like below.
ja_jp: QuarkusにはDynamoDB、S3、SNS、SQS (他にも追加中) のエクステンションが追加されました。以下のように手動でワイヤリングするのではなく、Quarkusを使って様々なAWSサービスを利用する方法については、 link:{amazon-services-guide}[これらのガイド] を確認してください。

source: Quarkus now offers a GraphQL client in the form of the link:/guides/smallrye-graphql-client[SmallRye GraphQL Client extension].
ja_jp: Quarkusは、 link:/guides/smallrye-graphql-client[SmallRye GraphQL Client エクステンション]という形で、GraphQLクライアントを提供しています。

source: Quarkus now provides `@QuarkusMainTest` and `@QuarkusMainIntegrationTest` to facilitate testing of CLI applications. Check out the link:/guides/command-mode-reference[command mode guide] for details.
ja_jp: Quarkusでは、CLIアプリケーションのテストを容易にするために、 `@QuarkusMainTest` と `@QuarkusMainIntegrationTest` を提供しています。詳細は、 link:/guides/command-mode-reference[コマンドモードガイド]をご覧ください。

source: Quarkus now provides a RESTEasy Reactive filter that might help to prevent CrossSite Request Forgery attacks.
ja_jp: CrossSite Request Forgery攻撃の防止に役立つRESTEasy ReactiveフィルターをQuarkusで利用できるようになりました。

source: Quarkus now ships with a new experimental Dev UI, which is available in dev mode (when you start quarkus with `mvn quarkus:dev`) at http://localhost:8080/q/dev[/q/dev] by default. It will show you something like this:
ja_jp: Quarkusは現在、新しく実験的なDev UIを搭載しています。このUIは、 devモード( `mvn quarkus:dev` でquarkusを起動)でデフォルトで利用可能で、link:http://localhost:8080/q/dev[/q/dev] に存在し、以下のようなものが表示されます。

source: Quarkus now supports the OpenTelemetry Autoconfiguration for Traces. The configurations match what you can see at https://github.com/open-telemetry/opentelemetry-java/blob/main/sdk-extensions/autoconfigure/README.md[OpenTelemetry SDK Autoconfigure] with the `quarkus.*` prefix.
ja_jp: QuarkusがOpenTelemetry Autoconfiguration for Tracesをサポートするようになりました。設定は、 link:https://github.com/open-telemetry/opentelemetry-java/blob/main/sdk-extensions/autoconfigure/README.md[OpenTelemetry SDK Autoconfigure] で確認できるものと一致し、 `quarkus.*` プレフィックスを使用しています。

source: Quarkus offers a comprehensive suite of messaging extensions designed to synchronize with leading messaging technologies effortlessly. This empowers developers to concentrate on crafting the core application logic, liberating them from the necessity to delve into the complexities of individual APIs and messaging infrastructures.
ja_jp: Quarkus では、主要なメッセージングテクノロジーと簡単に同期できるように設計された包括的なメッセージングエクステンションスイートを提供しています。 これにより、開発者はコアアプリケーションロジックの作成に集中できるようになり、個々の API やメッセージングインフラストラクチャーの複雑さを詳しく調べる必要がなくなります。

source: Quarkus offers a large set of reactive APIs and features. This section lists the most important, but it's not an exhaustive list. Quarkus adds new features in every release, and the https://github.com/quarkiverse[Quarkiverse] proposes many extensions enabling _Reactive_.
ja_jp: Quarkusは、多くのリアクティブAPIと機能を提供しています。このセクションでは、最も重要なものをリストアップしていますが、網羅的なリストではありません。Quarkusはリリースごとに新しい機能を追加しており、 link:https://github.com/quarkiverse[Quarkiverse]では _リアクティブ_ を有効にする多くのエクステンションが提案されています。

source: Quarkus offers a seamless solution for building AI-infused applications. It automatically manages communication with the AI model, ensuring that inputs and outputs are adequately guarded and processed. Quarkus also provides built-in auditing and observability features.
ja_jp: Quarkus は、AI を組み込んだアプリケーションを構築するためのシームレスなソリューションを提供します。AI モデルとの通信を自動的に管理し、入力と出力が適切に保護され、処理されるようにします。Quarkus には、組み込みの監査機能と監視機能も用意されています。

source: Quarkus offers a set of annotations that can be used in a CDI managed bean to enable caching abilities.
ja_jp: Quarkusは、CDI管理されたBeanで使用できる、キャッシュ機能を有効にするアノテーションのセットを提供します。

source: Quarkus offers an extensive collection of extensions to connect to web, data and messaging systems, providing the developer fantastic functionality at his disposal. However, in many cases, the problem at hand already belongs to one (or more) of the well-known https://www.enterpriseintegrationpatterns.com/toc.html[enterprise integration patterns^].
ja_jp: Quarkusには、Web、データ、メッセージングシステムに接続するためのエクステンションが豊富に用意されており、開発者が自由に使える素晴らしい機能が提供されています。しかし、多くの場合、手元の問題はすでによく知られた link:https://www.enterpriseintegrationpatterns.com/toc.html[エンタープライズ統合, window=_blank]パターンの1つ（または複数）に属しています。

source: Quarkus offers both imperative and reactive programmatic paradigms and we work hard making sure both are exposed across the board.
ja_jp: Quarkusは、命令型とリアクティブ型の両方のプログラムパラダイムを提供しており、その両方が全面的に公開されるように努力しています。

source: Quarkus offers several reactive clients for use with a reactive datasource.
ja_jp: Quarkusには、リアクティブデータソースで使用できるリアクティブクライアントがいくつかあります。

source: Quarkus offers the ability to automatically generate Kubernetes resources based on sane defaults and user-supplied configuration using https://github.com/dekorateio/dekorate/[dekorate]. It currently supports generating resources for vanilla <<#kubernetes,Kubernetes>>, <<#openshift,OpenShift>> and <<#knative,Knative>>. Furthermore, Quarkus can deploy the application to a target Kubernetes cluster by applying the generated manifests to the target cluster's API Server. Finally, when either one of container image extensions is present (see the xref:container-image.adoc[container image guide] for more details), Quarkus has the ability to create a container image and push it to a registry *before* deploying the application to the target platform.
ja_jp: Quarkusは、https://github.com/dekorateio/dekorate/[dekorate] を使用して、妥当なデフォルトとユーザーが提供する設定に基づいて Kubernetes リソースを自動的に生成する機能を提供しています。 現在、バニラ <<#kubernetes,Kubernetes>>、<<#openshift,OpenShift>>、および <<#knative,Knative>> のリソースの生成をサポートしています。 さらに、Quarkusは、生成されたマニフェストをターゲットクラスターの API Server に適用することで、ターゲット Kubernetes クラスターにアプリケーションをデプロイできます。 最後に、コンテナーイメージエクステンションのいずれかが存在する場合 (詳細は xref:container-image.adoc[コンテナーイメージガイド] を参照)、Quarkus では、ターゲットプラットフォームにアプリケーションをデプロイする *前* に、コンテナーイメージを作成してレジストリーにプッシュする機能があります。

source: Quarkus offers the ability to automatically generate Kubernetes resources based on sane defaults and user-supplied configuration using https://github.com/dekorateio/dekorate/[dekorate]. It currently supports generating resources for vanilla xref:kubernetes[Kubernetes], xref:openshift[OpenShift] and xref:knative[Knative]. Furthermore, Quarkus can deploy the application to a target Kubernetes cluster by applying the generated manifests to the target cluster's API Server. Finally, when either one of container image extensions is present (see the xref:container-image.adoc[container image guide] for more details), Quarkus has the ability to create a container image and push it to a registry *before* deploying the application to the target platform.
ja_jp: Quarkusは、 link:https://github.com/dekorateio/dekorate/[dekorate] を使用して、穏当なデフォルトとユーザーが提供する設定に基づいて、Kubernetesリソースを自動的に生成する機能を提供します。現在、vanilla xref:kubernetes[Kubernetes] 、 xref:openshift[OpenShift] 、 xref:knative[Knative] のリソースを生成することをサポートしています。さらに、Quarkusは、生成されたマニフェストをターゲットクラスタのAPIサーバーに適用することで、アプリケーションをターゲットKubernetesクラスタにデプロイできます。最後に、コンテナイメージのエクステンションのいずれかが存在する場合（詳細は xref:container-image.adoc[コンテナイメージのガイド] を参照）、Quarkusには、アプリケーションをターゲットプラットフォームにデプロイする *前に* 、コンテナイメージを作成し、レジストリにプッシュする機能があります。

source: Quarkus offers the ability to automatically generate OpenShift resources based on sane defaults and user supplied configuration. The OpenShift extension is actually a wrapper extension that brings configures the xref:deploying-to-kubernetes.adoc[Kubernetes] extension with sensible defaults so that it's easier for the user to get started with Quarkus on OpenShift.
ja_jp: Quarkusは、適切なデフォルトとユーザーが提供する設定に基づいてOpenShiftリソースを自動的に生成する機能を提供します。 OpenShiftエクステンションは、実際には、ユーザーがOpenShift上でQuarkusを簡単に始められるように、 xref:deploying-to-kubernetes.adoc[Kubernetes] エクステンションを賢明なデフォルトで設定するラッパーエクステンションです。

source: Quarkus offers the ability to automatically generate OpenShift resources based on sane defaults and user supplied configuration. The OpenShift extension is actually a wrapper extension that brings together the xref:deploying-to-kubernetes.adoc[kubernetes] and xref:container-image.adoc#s2i[container-image-s2i] extensions with sensible defaults so that it's easier for the user to get started with Quarkus on OpenShift.
ja_jp: Quarkusには、妥当なデフォルトとユーザーが提供する設定に基づいて、OpenShiftリソースを自動的に生成する機能があります。OpenShiftエクステンションは実際にはラッパーエクステンションであり、 xref:deploying-to-kubernetes.adoc[Kubernetes] エクステンションと xref:container-image.adoc#s2i[container-image-s2i] エクステンションを気の利いたデフォルトでまとめ、ユーザーがQuarkus on OpenShiftを簡単に始められるようにしています。

source: Quarkus offers the possibility to use YAML in addition to the standard Java Properties file.
ja_jp: Quarkusでは、標準のJavaプロパティファイルに加えてYAMLを使用することができます。

source: Quarkus offers unequaled performance
ja_jp: Quarkus は比類のないパフォーマンスを発揮します

source: Quarkus only implements a subset of the CDI features and comes with non-standard features and specific APIS, you can learn more about it in the xref:cdi-reference.adoc[Contexts and Dependency Injection guide].
ja_jp: Quarkus は CDI 機能のサブセットのみを実装しており、非標準の機能や特定の API が付属しています。詳細は、 xref:cdi-reference.adoc[コンテキストと依存性注入ガイド] を参照してください。

source: Quarkus overrides the logging Mapped Diagnostic Context (MDC) to improve compatibility with its reactive core.
ja_jp: Quarkus は、リアクティブコアとの互換性を高めるために、ロギングの Mapped Diagnostic Context (MDC) をオーバーライドします。

source: Quarkus overrides the logging Mapped Diagnostic Context (MDC) to improve the compatibility with its reactive core.
ja_jp: Quarkusは、ロギングのMapped Diagnostic Context（MDC）をオーバーライドし、リアクティブコアとの互換性を向上させます。

source: Quarkus package type
ja_jp: Quarkusパッケージタイプ

source: Quarkus performs a build-time check for registration configuration.
ja_jp: Quarkus はビルド時に登録設定のチェックを実行します。
